### **Pandas Read Sql**

Beberapa alternatif cara untuk mengakses databases berbasis MySQL.

In [17]:
import pandas as pd
import mysql.connector

### 1. MySQL Connector

In [18]:
dbku = mysql.connector.connect(
    host = "localhost",
    user = "mnrclab",
    passwd = "",
    database = "pandas_tes"
)
query = "select * from employees"
df = pd.read_sql(query, dbku)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:10

In [14]:
df.dtypes

id                int64
nama             object
email            object
waktu    datetime64[ns]
dtype: object

### 2. Database String URI

In [29]:
query = "select * from employees"
alamatDB = "mysql://root:@localhost:3306/pandas_tes"
df = pd.read_sql(query, alamatDB)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:10

### 3. MySQL Alchemy

#### a. Cara Pertama

In [31]:
import pandas as pd
import sqlalchemy as sqlac

In [37]:
query = 'select * from employees'
engine = sqlac.create_engine(
    'mysql://root:@localhost:3306/pandas_tes'
)
df = pd.read_sql(query, engine)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:10

#### b. Cara Kedua

In [60]:
engine = sqlac.create_engine(
    'mysql://root:@localhost:3306/pandas_tes'
)
df1 = pd.read_sql('employees', engine)
df1

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:10

#### Hanya akses kolom tertentu

In [56]:
engine = sqlac.create_engine(
    'mysql://root:@localhost:3306/pandas_tes'
)
df2 = pd.read_sql('employees', engine, columns=['nama'])
df2

      nama
0   Asnawi
1    Bagas
2     Evan
3  Osvaldo

In [57]:
df3 = pd.read_sql('select nama, waktu from employees', engine)
df3

      nama               waktu
0   Asnawi 2019-12-09 09:29:10
1    Bagas 2019-12-09 09:29:10
2     Evan 2019-12-09 09:29:10
3  Osvaldo 2019-12-09 09:29:10

### d) Membuat Database From DataFrame

#### i) Membuat Table 'daftarkaryawan' di Suatu Database

In [ ]:
df3.to_sql(
    name = 'daftarkaryawan', #PASTIKAN LOWERCASE
    con = engine
)

#### ii) Membuat Table 'superheros' di Suatu Database

In [63]:
df1.to_sql(
    name = 'superheros',
    con = engine,
)

#### iii) Menambahkan DataFrame (df1) ke Table Superhero

In [64]:
df1.to_sql(
    name = 'superheros',
    con = engine,
    if_exists = 'append'
)

#### iv) Me-replace Table 'superhero' dengan isi Dataframe df1

In [65]:
df1.to_sql(
    name = 'superheros',
    con = engine,
    if_exists = 'replace'
)

# setelah dijalankan bisa dicek di CMD

### e) Mengupdate DataFrame

In [69]:
#Membuat dataframe baru
newData = pd.DataFrame([
    {'id':5, 'nama':'Saddil',
    'email': 'saddil@gmail.com',
    'waktu': '2019-12-10 10:22:31'
    }
])

newData

   id    nama             email                waktu
0   5  Saddil  saddil@gmail.com  2019-12-10 10:22:31

In [74]:
#Menggabungkan dataframe baru ke Dataframe df1
df4 = pd.concat([df1, newData], ignore_index=True)
df4

   id     nama              email                waktu
0   1   Asnawi    asnawi@yahoo.id  2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id  2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id  2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id  2019-12-09 09:29:10
4   5   Saddil   saddil@gmail.com  2019-12-10 10:22:31

### f) Group & Find Data based on Date (Parsing Date)

In [76]:
dfX = pd.read_sql_query(
    'select * from employees', engine,
    parse_dates = ['waktu'], #untuk mengubah sebuah kolom menjadi date, untuk memastikan barangkali masih dalam bentuk string
    index_col = 'waktu' #kolom waktu dijadikan index
)
dfX

                     id     nama              email
waktu
2019-12-09 09:29:10   1   Asnawi    asnawi@yahoo.id
2019-12-09 09:29:10   2    Bagas  bagasadi@yahoo.id
2019-12-09 09:29:10   3     Evan    evandd@yahoo.id
2019-12-09 09:29:10   4  Osvaldo   osvaldo@yahoo.id

In [77]:
#mengakses data yang hanya bulan Desember 2019
dfX['2019-12']

                     id     nama              email
waktu
2019-12-09 09:29:10   1   Asnawi    asnawi@yahoo.id
2019-12-09 09:29:10   2    Bagas  bagasadi@yahoo.id
2019-12-09 09:29:10   3     Evan    evandd@yahoo.id
2019-12-09 09:29:10   4  Osvaldo   osvaldo@yahoo.id

In [95]:
newData = pd.DataFrame([
    {'id':5, 'nama':'Saddil',
    'email': 'saddil@gmail.com',
    'waktu': '2019-02-10 10:22:31'
    }
])
# newData['waktu'] = pd.to_datetime(newData['waktu']) #cara pertama
newData['waktu'] = newData['waktu'].astype('datetime64') #cara kedua

dfX = pd.read_sql_query(
    'select * from employees', engine,
    parse_dates = ['waktu']
)

dfA = pd.concat([dfX, newData], ignore_index=True)
dfA

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:10
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:10
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:10
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:10
4   5   Saddil   saddil@gmail.com 2019-02-10 10:22:31

In [96]:
dfA.set_index('waktu', inplace=True)
dfA

                     id     nama              email
waktu
2019-12-09 09:29:10   1   Asnawi    asnawi@yahoo.id
2019-12-09 09:29:10   2    Bagas  bagasadi@yahoo.id
2019-12-09 09:29:10   3     Evan    evandd@yahoo.id
2019-12-09 09:29:10   4  Osvaldo   osvaldo@yahoo.id
2019-02-10 10:22:31   5   Saddil   saddil@gmail.com

In [98]:
dfA['2019-12']

                     id     nama              email
waktu
2019-12-09 09:29:10   1   Asnawi    asnawi@yahoo.id
2019-12-09 09:29:10   2    Bagas  bagasadi@yahoo.id
2019-12-09 09:29:10   3     Evan    evandd@yahoo.id
2019-12-09 09:29:10   4  Osvaldo   osvaldo@yahoo.id

In [99]:
dfA['2019-02']

                     id    nama             email
waktu
2019-02-10 10:22:31   5  Saddil  saddil@gmail.com